---
title: RevitAPIEventArgs
classe: Autodesk.Revit.DB.Events.RevitAPIEventArgs
namespace: Autodesk.Revit.DB.Events
eredita: System.EventArgs
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 4
---

# RevitAPIEventArgs

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Boolean Cancellable { get; }` | `revitAPIEventArgs.Cancellable` | Boolean |
| `Boolean IsValidObject { get; }` | `revitAPIEventArgs.IsValidObject` | Boolean |
| `Void Dispose()` | `revitAPIEventArgs.Dispose()` | Void |
| `Boolean IsCancelled()` | `revitAPIEventArgs.IsCancelled()` | Boolean |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```